In [3]:
# warning(library(dplyr))
# suppressWarnings(library(dplyr))
library(dplyr)

Warning message in eval(expr, envir, enclos):
"dplyrstatsgraphicsgrDevicesutilsdatasetsmethodsbase"

In [4]:
exam <- read.csv("./Data/csv_exam.csv")
exam

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   8 2     90   78      25
9   9 3     20   98      15
10 10 3     50   98      45
11 11 3     65   65      65
12 12 3     45   85      32
13 13 4     46   98      65
14 14 4     48   87      12
15 15 4     75   56      78
16 16 4     58   98      65
17 17 5     65   68      98
18 18 5     80   78      90
19 19 5     89   68      87
20 20 5     78   83      58

In [5]:
# exam 에서 class 가 1 인 경우만 추출하여 출력
exam %>% filter(class == 1)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60
3 3  1     45   86      78
4 4  1     30   98      58

In [7]:
# 2 반인 경우만 추출
exam %>% filter(class == 2)

  id class math english science
1 5  2     25   80      65
2 6  2     50   89      98
3 7  2     80   90      45
4 8  2     90   78      25

In [8]:
# 1 반이 아닌 경우
exam %>% filter(class != 1)

   id class math english science
1   5 2     25   80      65
2   6 2     50   89      98
3   7 2     80   90      45
4   8 2     90   78      25
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  13 4     46   98      65
10 14 4     48   87      12
11 15 4     75   56      78
12 16 4     58   98      65
13 17 5     65   68      98
14 18 5     80   78      90
15 19 5     89   68      87
16 20 5     78   83      58

In [9]:
# 3 반이 아닌 경우
exam %>% filter(class != 3)

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   8 2     90   78      25
9  13 4     46   98      65
10 14 4     48   87      12
11 15 4     75   56      78
12 16 4     58   98      65
13 17 5     65   68      98
14 18 5     80   78      90
15 19 5     89   68      87
16 20 5     78   83      58

In [10]:
# 수학 점수가 50 점을 초과한 경우
exam %>% filter(math > 50)

   id class math english science
1   2 1     60   97      60
2   7 2     80   90      45
3   8 2     90   78      25
4  11 3     65   65      65
5  15 4     75   56      78
6  16 4     58   98      65
7  17 5     65   68      98
8  18 5     80   78      90
9  19 5     89   68      87
10 20 5     78   83      58

In [11]:
# 수학 점수가 50 점 미만인 경우
exam %>% filter(math < 50)

  id class math english science
1  3 1     45   86      78
2  4 1     30   98      58
3  5 2     25   80      65
4  9 3     20   98      15
5 12 3     45   85      32
6 13 4     46   98      65
7 14 4     48   87      12

In [12]:
# 영어점수가 80 점 이상인 경우
exam %>% filter(english >= 80)

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   9 3     20   98      15
9  10 3     50   98      45
10 12 3     45   85      32
11 13 4     46   98      65
12 14 4     48   87      12
13 16 4     58   98      65
14 20 5     78   83      58

In [13]:
# 영어점수가 80 점 이하인 경우
exam %>% filter(english <= 80)

  id class math english science
1  5 2     25   80      65
2  8 2     90   78      25
3 11 3     65   65      65
4 15 4     75   56      78
5 17 5     65   68      98
6 18 5     80   78      90
7 19 5     89   68      87

In [14]:
# 1 반 이면서 수학 점수가 50 점 이상인 경우
exam %>% filter(class == 1 & math >= 50)

  id class math english science
1 1  1     50   98      50
2 2  1     60   97      60

In [16]:
# 2 반 이면서 영어점수가 80 점 이상인 경우
exam %>% filter(class == 2 & english >= 80)

  id class math english science
1 5  2     25   80      65
2 6  2     50   89      98
3 7  2     80   90      45

In [17]:
# 수학 점수가 90 점 이상이거나 영어점수가 90 점 이상인 경우
exam %>% filter(math >= 90 | english >= 90)

  id class math english science
1  1 1     50   98      50
2  2 1     60   97      60
3  4 1     30   98      58
4  7 2     80   90      45
5  8 2     90   78      25
6  9 3     20   98      15
7 10 3     50   98      45
8 13 4     46   98      65
9 16 4     58   98      65

In [18]:
# 영어점수가 90 점 미만이거나 과학점수가 50 점 미만인 경우
exam %>% filter(english < 90 | science < 50)

   id class math english science
1   3 1     45   86      78
2   5 2     25   80      65
3   6 2     50   89      98
4   7 2     80   90      45
5   8 2     90   78      25
6   9 3     20   98      15
7  10 3     50   98      45
8  11 3     65   65      65
9  12 3     45   85      32
10 14 4     48   87      12
11 15 4     75   56      78
12 17 5     65   68      98
13 18 5     80   78      90
14 19 5     89   68      87
15 20 5     78   83      58

In [19]:
# 1, 3, 5 반에 해당되면 추출
exam %>% filter(class == 1 | class == 3 | class == 5)

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  17 5     65   68      98
10 18 5     80   78      90
11 19 5     89   68      87
12 20 5     78   83      58

In [20]:
# 1, 3, 5 반에 해당하면 추출
exam %>% filter(class %in% c(1,3,5))

   id class math english science
1   1 1     50   98      50
2   2 1     60   97      60
3   3 1     45   86      78
4   4 1     30   98      58
5   9 3     20   98      15
6  10 3     50   98      45
7  11 3     65   65      65
8  12 3     45   85      32
9  17 5     65   68      98
10 18 5     80   78      90
11 19 5     89   68      87
12 20 5     78   83      58

In [21]:
class1 <- exam %>% filter(class == 1) # class 가 1 인 행 추출, class1 에 할당
class2 <- exam %>% filter(class == 2) # class 가 2 인 행 추출, class2 에 할당

In [22]:
mean(class1$math) # 1 반 수학 점수 평균 구하기

[1] 46.25

In [23]:
mean(class2$math) # 2 반 수학 점수 평균 구하기

[1] 61.25

## R에서 사용하는 기호들
### 논리 연산자 기능

```
< 작다
<= 작거나 같다
> 크다
>= 크거나 같다
== 같다
!= 같지 않다
│ 또는
& 그리고
%in% 매칭 확인
```

### 산술 연산자 기능

```
+ 더하기
- 빼기
* 곱하기
/ 나누기
^ , ** 제곱
%/% 나눗셈의 몫
%% 나눗셈의 나머지
```

Q1. 자동차 배기량에 따라 고속도로 연비가 다른지 알아보려고 합니다.  
displ(배기량)이 4 이하인 자동차와 5 이상인 자동차 중  
어떤 자동차의 hwy(고속도로 연비)가 평균적으로 더 높은지 알아보세요

In [24]:
mpg <- as.data.frame(ggplot2::mpg) # mpg 데이터 불러오기

In [25]:
mpg_a <- mpg %>% filter(displ <= 4) # displ 4 이하 추출
mpg_b <- mpg %>% filter(displ >= 5) # displ 5 이상 추출

In [26]:
mean(mpg_a$hwy) # displ 4 이하 hwy 평균

[1] 25.96319

In [27]:
mean(mpg_b$hwy) # displ 5 이상 hwy 평균

[1] 18.07895

Q2. 자동차 제조 회사에 따라 도시 연비가 다른지 알아보려고 합니다.  
"audi"와 "toyota" 중 어느 manufacturer(자동차 제조 회사)의  
cty(도시 연비)가 평균적으로 더 높은지 알아보세요.

In [29]:
mpg_audi <- mpg %>% filter(manufacturer == "audi") # audi 추출
mpg_toyota <- mpg %>% filter(manufacturer == "toyota") # toyota 추출

In [30]:
mean(mpg_audi$cty) # audi 의 cty 평균

[1] 17.61111

In [31]:
mean(mpg_toyota$cty) # toyota 의 cty 평균

[1] 18.52941

Q3. "chevrolet", "ford", "honda" 자동차의 고속도로 연비 평균을 알아보려고 합니다.  
이 회사들의 자동차를 추출한 뒤 hwy 전체 평균을 구해보세요.

In [32]:
# manufacturer 가 chevrolet, ford, honda 에 해당하면 추출
mpg_new <- mpg %>% filter(manufacturer %in% c("chevrolet", "ford", "honda"))
mean(mpg_new$hwy)

[1] 22.50943

In [33]:
# 필요한 변수(컬럼)만 추출 하기
exam %>% select(math) # math 추출

   math
1  50
2  60
3  45
4  30
5  25
6  50
7  80
8  90
9  20
10 50
11 65
12 45
13 46
14 48
15 75
16 58
17 65
18 80
19 89
20 78

In [33]:
exam %>% select(english) # english 추출

   english
1  98
2  97
3  86
4  98
5  80
6  89
7  90
8  78
9  98
10 98
11 65
12 85
13 98
14 87
15 56
16 98
17 68
18 78
19 68
20 83

In [34]:
exam %>% select(class, math, english) # class, math, english 변수 추출

   class math english
1  1     50   98
2  1     60   97
3  1     45   86
4  1     30   98
5  2     25   80
6  2     50   89
7  2     80   90
8  2     90   78
9  3     20   98
10 3     50   98
11 3     65   65
12 3     45   85
13 4     46   98
14 4     48   87
15 4     75   56
16 4     58   98
17 5     65   68
18 5     80   78
19 5     89   68
20 5     78   83

In [122]:
exam %>% select(-math) # math 제외

   id class english science
1   1 1     98      50
2   2 1     97      60
3   3 1     86      78
4   4 1     98      58
5   5 2     80      65
6   6 2     89      98
7   7 2     90      45
8   8 2     78      25
9   9 3     98      15
10 10 3     98      45
11 11 3     65      65
12 12 3     85      32
13 13 4     98      65
14 14 4     87      12
15 15 4     56      78
16 16 4     98      65
17 17 5     68      98
18 18 5     78      90
19 19 5     68      87
20 20 5     83      58

In [123]:
exam %>% select(-math, -english) # math, english 제외

   id class science
1   1 1     50
2   2 1     60
3   3 1     78
4   4 1     58
5   5 2     65
6   6 2     98
7   7 2     45
8   8 2     25
9   9 3     15
10 10 3     45
11 11 3     65
12 12 3     32
13 13 4     65
14 14 4     12
15 15 4     78
16 16 4     65
17 17 5     98
18 18 5     90
19 19 5     87
20 20 5     58

In [37]:
# class 가 1 인 행만 추출한 다음 english 추출
exam %>% filter(class == 1) %>% select(english)

  english
1 98
2 97
3 86
4 98

In [38]:
exam %>%
 filter(class == 1) %>% # class 가 1 인 행 추출
 select(english) # english 추출

  english
1 98
2 97
3 86
4 98

In [39]:
exam %>%
 select(id, math) %>% # id, math 추출
 head # 앞부분 6 행까지 추출

  id math
1 1  50
2 2  60
3 3  45
4 4  30
5 5  25
6 6  50

In [40]:
exam %>%
 select(id, math) %>% # id, math 추출
 head(10) # 앞부분 10 행까지 추출

   id math
1   1 50
2   2 60
3   3 45
4   4 30
5   5 25
6   6 50
7   7 80
8   8 90
9   9 20
10 10 50

Q1. mpg 데이터는 11개 변수로 구성되어 있습니다.  
이 중 일부만 추출해서 분석에 활용하려고 합니다.  
mpg 데이터에서 class(자동차 종류), cty(도시 연비) 변수를 추출해 새로운 데이터를 만드세요.  
새로 만든 데이터의 일부를 출력해서 두 변수로만 구성되어 있는지 확인하세요.

In [41]:
mpg <- as.data.frame(ggplot2::mpg) # mpg 데이터 불러오기
df <- mpg %>% select(class, cty) # class, cty 변수 추출
head(df) # df 일부 출력

  class   cty
1 compact 18
2 compact 21
3 compact 20
4 compact 21
5 compact 16
6 compact 18

Q2. 자동차 종류에 따라 도시 연비가 다른지 알아보려고 합니다.  
앞에서 추출한 데이터를 이용해서 class(자동차 종류)가  
"suv"인 자동차와 "compact"인 자동차 중 어떤 자동차의  
cty(도시 연비)가 더 높은지 알아보세요.

In [42]:
df_suv <- df %>% filter(class == "suv") # class 가 suv 인 행 추출
df_compact <- df %>% filter(class == "compact") # class 가 compact 인 행 추출

In [43]:
mean(df_suv$cty) # suv 의 cty 평균

[1] 13.5

In [44]:
mean(df_compact$cty) # compact 의 cty 평균

[1] 20.12766

In [49]:
# 오름차순으로 정렬하기
exam %>% arrange(math) # math 오름차순 정렬

   id class math english science
1   9 3     20   98      15
2   5 2     25   80      65
3   4 1     30   98      58
4   3 1     45   86      78
5  12 3     45   85      32
6  13 4     46   98      65
7  14 4     48   87      12
8   1 1     50   98      50
9   6 2     50   89      98
10 10 3     50   98      45
11 16 4     58   98      65
12  2 1     60   97      60
13 11 3     65   65      65
14 17 5     65   68      98
15 15 4     75   56      78
16 20 5     78   83      58
17  7 2     80   90      45
18 18 5     80   78      90
19 19 5     89   68      87
20  8 2     90   78      25

In [50]:
# 내림차순으로 정렬하기
exam %>% arrange(desc(math)) # math 내림차순 정렬

   id class math english science
1   8 2     90   78      25
2  19 5     89   68      87
3   7 2     80   90      45
4  18 5     80   78      90
5  20 5     78   83      58
6  15 4     75   56      78
7  11 3     65   65      65
8  17 5     65   68      98
9   2 1     60   97      60
10 16 4     58   98      65
11  1 1     50   98      50
12  6 2     50   89      98
13 10 3     50   98      45
14 14 4     48   87      12
15 13 4     46   98      65
16  3 1     45   86      78
17 12 3     45   85      32
18  4 1     30   98      58
19  5 2     25   80      65
20  9 3     20   98      15

In [51]:
# 정렬 기준 변수 여러개 지정
exam %>% arrange(class, math) # class 및 math 오름차순 정렬

   id class math english science
1   4 1     30   98      58
2   3 1     45   86      78
3   1 1     50   98      50
4   2 1     60   97      60
5   5 2     25   80      65
6   6 2     50   89      98
7   7 2     80   90      45
8   8 2     90   78      25
9   9 3     20   98      15
10 12 3     45   85      32
11 10 3     50   98      45
12 11 3     65   65      65
13 13 4     46   98      65
14 14 4     48   87      12
15 16 4     58   98      65
16 15 4     75   56      78
17 17 5     65   68      98
18 20 5     78   83      58
19 18 5     80   78      90
20 19 5     89   68      87

mpg 데이터를 이용해서 분석 문제를 해결해보세요.  
• "audi"에서 생산한 자동차 중에 어떤 자동차 모델의 hwy(고속도로 연비)가 높은지 알아보려고 합니다.  
"audi"에서 생산한 자동차 중 hwy가 1~5위에 해당하는 자동차의 데이터를 출력하세요.

In [52]:
mpg <- as.data.frame(ggplot2::mpg) # mpg 데이터 불러오기

mpg %>% filter(manufacturer == "audi") %>% # audi 추출
 arrange(desc(hwy)) %>% # hwy 내림차순 정렬
 head(5) # 5 행까지 출력

  manufacturer model      displ year cyl trans      drv cty hwy fl class
1 audi         a4         2.0   2008 4   manual(m6) f   20  31  p  compact
2 audi         a4         2.0   2008 4   auto(av)   f   21  30  p  compact
3 audi         a4         1.8   1999 4   auto(l5)   f   18  29  p  compact
4 audi         a4         1.8   1999 4   manual(m5) f   21  29  p  compact
5 audi         a4 quattro 2.0   2008 4   manual(m6) 4   20  28  p  compact

In [55]:
#  파생변수 추가하기
exam %>%
 mutate(total = math + english + science) %>% # 총합 변수 추가
 head(5) -> # 일부 추출
 exam_total

In [56]:
exam_total

  id class math english science total
1 1  1     50   98      50      198
2 2  1     60   97      60      217
3 3  1     45   86      78      209
4 4  1     30   98      58      186
5 5  2     25   80      65      170

In [57]:
# 여러 파생변수 한 번에 추가하기
exam %>%
 mutate(total = math + english + science, # 총합 변수 추가
        mean = (math + english + science)/3) %>% # 총평균 변수 추가
 head # 일부 추출

  id class math english science total mean
1 1  1     50   98      50      198   66.00000
2 2  1     60   97      60      217   72.33333
3 3  1     45   86      78      209   69.66667
4 4  1     30   98      58      186   62.00000
5 5  2     25   80      65      170   56.66667
6 6  2     50   89      98      237   79.00000

In [58]:
# mutate()에 ifelse() 적용하기
exam %>%
 mutate(test = ifelse(science >= 60, "pass", "fail")) %>%
 head

  id class math english science test
1 1  1     50   98      50      fail
2 2  1     60   97      60      pass
3 3  1     45   86      78      pass
4 4  1     30   98      58      fail
5 5  2     25   80      65      pass
6 6  2     50   89      98      pass

In [60]:
# 추가한 변수를 dplyr 코드에 바로 활용하기
exam %>%
 mutate(total = math + english + science) %>% # 총합 변수 추가
 arrange(total) %>% # 총합 변수 기준 정렬
 head # 일부 추출

  id class math english science total
1  9 3     20   98      15      133
2 14 4     48   87      12      147
3 12 3     45   85      32      162
4  5 2     25   80      65      170
5  4 1     30   98      58      186
6  8 2     90   78      25      193

Q1. mpg 데이터 복사본을 만들고, cty와 hwy를 더한 '합산 연비 변수'를 추가하세요.

In [131]:
mpg <- as.data.frame(ggplot2::mpg) # mpg 데이터 불러오기
mpg_new <- mpg # 복사본 만들기
mpg_new <- mpg_new %>% mutate(total = cty + hwy) # 합산 변수 만들기

Q2. 앞에서 만든 '합산 연비 변수'를 2로 나눠 '평균 연비 변수'를 추가세요.

In [132]:
mpg_new <- mpg_new %>% mutate(mean = total/2) # 평균 변수 만들기

In [133]:
head(mpg_new)

  manufacturer model displ year cyl trans      drv cty hwy fl class   total
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact 47
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact 50
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact 51
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact 51
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact 42
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact 44
  mean
1 23.5
2 25.0
3 25.5
4 25.5
5 21.0
6 22.0

Q3. '평균 연비 변수'가 가장 높은 자동차 3종의 데이터를 출력하세요.

In [134]:
mpg_new %>%
 arrange(desc(mean)) %>% # 내림차순 정렬
 head(3) # 상위 3 행 출력

  manufacturer model      displ year cyl trans      drv cty hwy fl class
1 volkswagen   new beetle 1.9   1999 4   manual(m5) f   35  44  d  subcompact
2 volkswagen   jetta      1.9   1999 4   manual(m5) f   33  44  d  compact
3 volkswagen   new beetle 1.9   1999 4   auto(l4)   f   29  41  d  subcompact
  total mean
1 79    39.5
2 77    38.5
3 70    35.0

Q4. 1~3번 문제를 해결할 수 있는 하나로 연결된 dplyr 구문을 만들어 출력하세요. 데이터는 복사본 대신
mpg 원본을 이용하세요.

In [61]:
mpg %>%
 mutate(total = cty + hwy, # 합산 변수 만들기
         mean = total/2) %>% # 평균 변수 만들기
 arrange(desc(mean)) %>% # 내림차순 정렬
 head(3)

  manufacturer model      displ year cyl trans      drv cty hwy fl class
1 volkswagen   new beetle 1.9   1999 4   manual(m5) f   35  44  d  subcompact
2 volkswagen   jetta      1.9   1999 4   manual(m5) f   33  44  d  compact
3 volkswagen   new beetle 1.9   1999 4   auto(l4)   f   29  41  d  subcompact
  total mean
1 79    39.5
2 77    38.5
3 70    35.0

In [62]:
# 집단별로 요약하기
exam %>% summarise(mean_math = mean(math)) # math 평균 산출

  mean_math
1 57.45

In [63]:
exam %>%
 group_by(class) %>% # class 별로 분리
 summarise(mean_math = mean(math)) # math 평균 산출

  class mean_math
1 1     46.25
2 2     61.25
3 3     45.00
4 4     56.75
5 5     78.00

In [64]:
# 여러 요약통계량 한 번에 산출하기
exam %>%
 group_by(class) %>% # class 별로 분리
 summarise(mean_math = mean(math), # math 평균
             sum_math = sum(math), # math 합계
             median_math = median(math), # math 중앙값
             n = n()) # 학생 수

  class mean_math sum_math median_math n
1 1     46.25     185      47.5        4
2 2     61.25     245      65.0        4
3 3     45.00     180      47.5        4
4 4     56.75     227      53.0        4
5 5     78.00     312      79.0        4

### 자주 사용하는 요약통계량 함수
함수 의미  
mean() 평균  
sd() 표준편차  
sum() 합계  
median() 중앙값  
min() 최솟값  
max() 최댓값  
n() 빈도

In [65]:
# 각 집단별로 다시 집단 나누기
mpg %>%
 group_by(manufacturer, drv) %>% # 회사별, 구방방식별 분리
 summarise(mean_cty = mean(cty)) %>% # cty 평균 산출
 head(10) # 일부 출력

   manufacturer drv mean_cty
1  audi         4   16.81818
2  audi         f   18.85714
3  chevrolet    4   12.50000
4  chevrolet    f   18.80000
5  chevrolet    r   14.10000
6  dodge        4   12.00000
7  dodge        f   15.81818
8  ford         4   13.30769
9  ford         r   14.75000
10 honda        f   24.44444

dplyr 조합하기  
문제) 회사별로 "suv" 자동차의 도시 및 고속도로 통합 연비 평균을 구해 내림차순으로 정렬하고, 1~5위까지 출력하기

분석 절차 생각해보기  
절차 기능 dplyr 함수  
1 회사별로 분리 group_by()  
2 suv 추출 filter()  
3 통합 연비 변수 생성 mutate()  
4 통합 연비 평균 산출 summarise()  
5 내림차순 정렬 arrange()  
6 1~5위까지 출력 head()

In [90]:
# dplyr 조합하기
mpg %>%
 group_by(manufacturer) %>% # 회사별로 분리
 filter(class == "suv") %>% # suv 추출
 mutate(tot = (cty+hwy)/2) %>% # 통합 연비 변수 생성
 summarise(mean_tot = mean(tot)) %>% # 통합 연비 평균 산출
 arrange(desc(mean_tot)) %>% # 내림차순 정렬
 head(5) # 1~5 위까지 출력

  manufacturer mean_tot
1 subaru       21.91667
2 toyota       16.31250
3 nissan       15.87500
4 mercury      15.62500
5 jeep         15.56250

Q1. mpg 데이터의 class는 "suv", "compact" 등 자동차를 특징에 따라 일곱 종류로 분류한 변수입니다.  
어떤 차종의 연비가 높은지 비교해보려고 합니다. class별 cty 평균을 구해보세요.

In [66]:
mpg <- as.data.frame(ggplot2::mpg) # mpg 데이터 불러오기

mpg %>%
 group_by(class) %>% # class 별 분리
 summarise(mean_cty = mean(cty)) # cty 평균 구하기

  class      mean_cty
1 2seater    15.40000
2 compact    20.12766
3 midsize    18.75610
4 minivan    15.81818
5 pickup     13.00000
6 subcompact 20.37143
7 suv        13.50000

Q2. 앞 문제의 출력 결과는 class 값 알파벳 순으로 정렬되어 있습니다.  
어떤 차종의 도시 연비가 높은지 쉽게 알아볼 수 있도록 cty 평균이 높은 순으로 정렬해 출력하세요.

In [67]:
mpg %>%
 group_by(class) %>% # class 별 분리
 summarise(mean_cty = mean(cty)) %>% # cty 평균 구하기
 arrange(desc(mean_cty)) # 내림차순 정렬하기

  class      mean_cty
1 subcompact 20.37143
2 compact    20.12766
3 midsize    18.75610
4 minivan    15.81818
5 2seater    15.40000
6 suv        13.50000
7 pickup     13.00000

Q3. 어떤 회사 자동차의 hwy(고속도로 연비)가 가장 높은지 알아보려고 합니다.  
hwy 평균이 가장 높은 회사 세 곳을 출력하세요

In [68]:
mpg %>%
 group_by(manufacturer) %>% # manufacturer 별 분리
 summarise(mean_hwy = mean(hwy)) %>% # hwy 평균 구하기
 arrange(desc(mean_hwy)) %>% # 내림차순 정렬하기
 head(3) # 상위 3 행 출력

  manufacturer mean_hwy
1 honda        32.55556
2 volkswagen   29.22222
3 hyundai      26.85714

Q4. 어떤 회사에서 "compact"(경차) 차종을 가장 많이 생산하는지 알아보려고 합니다.  
각 회사별 "compact" 차종 수를 내림차순으로 정렬해 출력하세요.

In [69]:
mpg %>%
 filter(class == "compact") %>% # compact 추출
 group_by(manufacturer) %>% # manufacturer 별 분리
 summarise(count = n()) %>% # 빈도 구하기
 arrange(desc(count)) # 내림차순 정렬

  manufacturer count
1 audi         15
2 volkswagen   14
3 toyota       12
4 subaru        4
5 nissan        2

In [70]:
# 데이터 합치기
# 가로로 합치기

# 중간고사 데이터 생성
test1 <- data.frame(id = c(1, 2, 3, 4, 5),
                     midterm = c(60, 80, 70, 90, 85))
# 기말고사 데이터 생성
test2 <- data.frame(id = c(1, 2, 3, 4, 5),
                     final = c(70, 83, 65, 95, 80))

In [71]:
test1 # test1 출력

  id midterm
1 1  60
2 2  80
3 3  70
4 4  90
5 5  85

In [72]:
test2 # test2 출력

  id final
1 1  70
2 2  83
3 3  65
4 4  95
5 5  80

In [73]:
# id 기준으로 합치기
total <- left_join(test1, test2, by = "id") # id 기준으로 합쳐 total 에 할당
total

  id midterm final
1 1  60      70
2 2  80      83
3 3  70      65
4 4  90      95
5 5  85      80

In [74]:
# 다른 데이터 활용해 변수 추가하기
# 반별 담임교사 명단 생성
name <- data.frame(class = c(1, 2, 3, 4, 5),
                    teacher = c("kim", "lee", "park", "choi", "jung"))
name

  class teacher
1 1     kim
2 2     lee
3 3     park
4 4     choi
5 5     jung

In [75]:
# class 기준 합치기
exam_new <- left_join(exam, name, by = "class")
exam_new

   id class math english science teacher
1   1 1     50   98      50      kim
2   2 1     60   97      60      kim
3   3 1     45   86      78      kim
4   4 1     30   98      58      kim
5   5 2     25   80      65      lee
6   6 2     50   89      98      lee
7   7 2     80   90      45      lee
8   8 2     90   78      25      lee
9   9 3     20   98      15      park
10 10 3     50   98      45      park
11 11 3     65   65      65      park
12 12 3     45   85      32      park
13 13 4     46   98      65      choi
14 14 4     48   87      12      choi
15 15 4     75   56      78      choi
16 16 4     58   98      65      choi
17 17 5     65   68      98      jung
18 18 5     80   78      90      jung
19 19 5     89   68      87      jung
20 20 5     78   83      58      jung

In [76]:
# 세로로 합치기
# 데이터 생성
# 학생 1~5 번 시험 데이터 생성
group_a <- data.frame(id = c(1, 2, 3, 4, 5),
                      test = c(60, 80, 70, 90, 85))
# 학생 6~10 번 시험 데이터 생성
group_b <- data.frame(id = c(6, 7, 8, 9, 10),
                      test = c(70, 83, 65, 95, 80))

In [77]:
group_a # group_a 출력

  id test
1 1  60
2 2  80
3 3  70
4 4  90
5 5  85

In [104]:
group_b # group_b 출력

  id test
1  6 70
2  7 83
3  8 65
4  9 95
5 10 80

In [78]:
# 세로로 합치기
group_all <- bind_rows(group_a, group_b) # 데이터 합쳐서 group_all 에 할당
group_all

   id test
1   1 60
2   2 80
3   3 70
4   4 90
5   5 85
6   6 70
7   7 83
8   8 65
9   9 95
10 10 80

mpg 데이터를 이용해서 분석 문제를 해결해 보세요.  
mpg 데이터의 fl 변수는 자동차에 사용하는 연료(fuel)를 의미합니다.  아래는 자동차 연료별 가격을 나타낸
표입니다. 
fl 연료 종류 가격(갤런당 USD)  
c CNG 2.35  
d diesel 2.38  
e ethanol E85 2.11  
p premium 2.76  
r regular 2.22  
우선 이 정보를 이용해서 연료와 가격으로 구성된 데이터 프레임을 만들어 보세요.

In [79]:
fuel <- data.frame(fl = c("c", "d", "e", "p", "r"),
                   price_fl = c(2.35, 2.38, 2.11, 2.76, 2.22),
                   stringsAsFactors = F)
fuel # 출력

  fl price_fl
1 c  2.35
2 d  2.38
3 e  2.11
4 p  2.76
5 r  2.22

Q1. mpg 데이터에는 연료 종류를 나타낸 fl 변수는 있지만 연료 가격을 나타낸 변수는 없습니다. 위에서 만든
fuel 데이터를 이용해서 mpg 데이터에 price_fl(연료 가격) 변수를 추가하세요.

In [80]:
mpg <- as.data.frame(ggplot2::mpg) # mpg 데이터 불러오기

mpg <- left_join(mpg, fuel, by = "fl") # mpg 에 연료 가격 변수 추가

In [81]:
head(mpg)

  manufacturer model displ year cyl trans      drv cty hwy fl class   price_fl
1 audi         a4    1.8   1999 4   auto(l5)   f   18  29  p  compact 2.76
2 audi         a4    1.8   1999 4   manual(m5) f   21  29  p  compact 2.76
3 audi         a4    2.0   2008 4   manual(m6) f   20  31  p  compact 2.76
4 audi         a4    2.0   2008 4   auto(av)   f   21  30  p  compact 2.76
5 audi         a4    2.8   1999 6   auto(l5)   f   16  26  p  compact 2.76
6 audi         a4    2.8   1999 6   manual(m5) f   18  26  p  compact 2.76

Q2. 연료 가격 변수가 잘 추가됐는지 확인하기 위해서 model, fl, price_fl 변수를 추출해 앞부분 5행을
출력해 보세요.

In [82]:
mpg %>%
 select(model, fl, price_fl) %>% # model, fl, price_fl 추출
 head(5)

  model fl price_fl
1 a4    p  2.76
2 a4    p  2.76
3 a4    p  2.76
4 a4    p  2.76
5 a4    p  2.76

## 정리하기  
### 1.조건에 맞는 데이터만 추출하기  
exam %>% filter(english >= 80)  
### 여러 조건 동시 충족  
exam %>% filter(class == 1 & math >= 50)  
### 여러 조건 중 하나 이상 충족
exam %>% filter(math >= 90 | english >= 90)  
exam %>% filter(class %in% c(1,3,5))  
### 2.필요한 변수만 추출하기  
exam %>% select(math)  
exam %>% select(class, math, english)  
### 3.함수 조합하기, 일부만 출력하기  
exam %>%  
 select(id, math) %>%  
 head(10)  
NP  
### 4.순서대로 정렬하기  
exam %>% arrange(math) # 오름차순 정렬  
exam %>% arrange(desc(math)) # 내림차순 정렬  
exam %>% arrange(class, math) # 여러 변수 기준 오름차순 정렬  
### 5.파생변수 추가하기  
exam %>% mutate(total = math + english + science)  
### 여러 파생변수 한 번에 추가하기  
exam %>%  
 mutate(total = math + english + science,  
 mean = (math + english + science)/3)  
### mutate()에 ifelse() 적용하기  
exam %>% mutate(test = ifelse(science >= 60, "pass", "fail"))  
### 추가한 변수를 dplyr 코드에 바로 활용하기  
exam %>%  
 mutate(total = math + english + science) %>%  
 arrange(total)  
NP  
### 6.집단별로 요약하기  
exam %>%  
 group_by(class) %>%  
 summarise(mean_math = mean(math))  
### 각 집단별로 다시 집단 나누기  
mpg %>%  
 group_by(manufacturer, drv) %>%  
 summarise(mean_cty = mean(cty))  
### 7.데이터 합치기  
### 가로로 합치기  
total <- left_join(test1, test2, by = "id")  
### 세로로 합치기  
group_all <- bind_rows(group_a, group_b)

### 분석 도전  
미국 동북중부 437개 지역의 인구통계 정보를 담고 있는 midwest 데이터를 사용해 데이터 분석 문제를 해결해 보세요.  
midwest는 ggplot2 패키지에 들어 있습니다.  
• 문제 1. popadults 는 해당 지역의 성인 인구, poptotal 은 전체 인구를 나타냅니다.  
          midwest 데이터에 '전체 인구 대비 미성년 인구 백분율' 변수를 추가하세요.  
• 문제 2. 미성년 인구 백분율이 가장 높은 상위 5 개 county(지역)의 미성년 인구 백분율을 출력하세요.  
• 문제 3. 분류표의 기준에 따라 미성년 비율 등급 변수를 추가하고, 각 등급에 몇 개의 지역이 있는지 알아보세요.  
분류 기준  
large 40% 이상  
middle 30% ~ 40% 미만  
small 30% 미만  
• 문제4. popasian은 해당 지역의 아시아인 인구를 나타냅니다. '전체 인구 대비 아시아인 인구 백분율' 변수를 추가하고,  
         하위 10개 지역의 state(주), county(지역명), 아시아인 인구 백분율을 출력하세요.

문제1. popadults는 해당 지역의 성인 인구, poptotal은 전체 인구를 나타냅니다. midwest 데이터에 '전체
인구 대비 미성년 인구 백분율' 변수를 추가하세요.

In [84]:
# midwest 불러오기
midwest <- as.data.frame(ggplot2::midwest)

# midwest 에 백분율 변수 추가
midwest %>% mutate(ratio_child = (poptotal-popadults)/poptotal*100) -> midwest
midwest

    PID  county      state area  poptotal popdensity popwhite popblack
1   561  ADAMS       IL    0.052   66090   1270.9615   63917     1702
2   562  ALEXANDER   IL    0.014   10626    759.0000    7054     3496
3   563  BOND        IL    0.022   14991    681.4091   14477      429
4   564  BOONE       IL    0.017   30806   1812.1176   29344      127
5   565  BROWN       IL    0.018    5836    324.2222    5264      547
6   566  BUREAU      IL    0.050   35688    713.7600   35157       50
7   567  CALHOUN     IL    0.017    5322    313.0588    5298        1
8   568  CARROLL     IL    0.027   16805    622.4074   16519      111
9   569  CASS        IL    0.024   13437    559.8750   13384       16
10  570  CHAMPAIGN   IL    0.058  173025   2983.1897  146506    16559
11  571  CHRISTIAN   IL    0.042   34418    819.4762   34176       82
12  572  CLARK       IL    0.030   15921    530.7000   15842       10
13  573  CLAY        IL    0.028   14460    516.4286   14403        4
14  574  CLINTON     IL    0.029   33944   1170.4828   32688     1021
15  575  COLES       IL    0.030   51644   1721.4667   50177      925
16  576  COOK        IL    0.058 5105067  88018.3966 3204947  1317147
17  577  CRAWFORD    IL    0.026   19464    748.6154   19300       63
18  578  CUMBERLAND  IL    0.020   10670    533.5000   10627        5
19  579  DE KALB     IL    0.038   77932   2050.8421   72968     2069
20  580  DE WITT     IL    0.023   16516    718.0870   16387       25
21  581  DOUGLAS     IL    0.025   19464    778.5600   19280       16
22  582  DU PAGE     IL    0.020  781666  39083.3000  714905    15462
23  583  EDGAR       IL    0.036   19595    544.3056   19469       68
24  584  EDWARDS     IL    0.014    7440    531.4286    7401        6
25  585  EFFINGHAM   IL    0.028   31704   1132.2857   31523       12
26  586  FAYETTE     IL    0.044   20893    474.8409   20148      599
27  587  FORD        IL    0.030   14275    475.8333   14157       43
28  588  FRANKLIN    IL    0.025   40319   1612.7600   40068       36
29  589  FULTON      IL    0.052   38080    732.3077   37117      668
30  590  GALLATIN    IL    0.019    6909    363.6316    6842       42
... ...  ...         ...   ...   ...      ...        ...      ...
408 3023 OCONTO      WI    0.060  30226    503.7667   29926      18
409 3024 ONEIDA      WI    0.071  31679    446.1831   31320      58
410 3025 OUTAGAMIE   WI    0.037 140510   3797.5676  136043     206
411 3026 OZAUKEE     WI    0.015  72831   4855.4000   71676     492
412 3027 PEPIN       WI    0.014   7107    507.6429    7070       2
413 3028 PIERCE      WI    0.034  32765    963.6765   32366      82
414 3029 POLK        WI    0.055  34773    632.2364   34348      23
415 3030 PORTAGE     WI    0.048  61405   1279.2708   59972     161
416 3031 PRICE       WI    0.075  15600    208.0000   15479       7
417 3032 RACINE      WI    0.020 175034   8751.7000  152098   16999
418 3033 RICHLAND    WI    0.034  17521    515.3235   17411      12
419 3034 ROCK        WI    0.042 139510   3321.6667  130803    6638
420 3035 RUSK        WI    0.055  15079    274.1636   14821      31
421 3036 ST CROIX    WI    0.044  50251   1142.0682   49895      44
422 3037 SAUK        WI    0.050  46975    939.5000   46459      54
423 3038 SAWYER      WI    0.079  14181    179.5063   11962      18
424 3039 SHAWANO     WI    0.054  37157    688.0926   35251      42
425 3040 SHEBOYGAN   WI    0.032 103877   3246.1562  100389     430
426 3041 TAYLOR      WI    0.057  18901    331.5965   18807       2
427 3042 TREMPEALEAU WI    0.043  25263    587.5116   25160      12
428 3043 VERNON      WI    0.048  25617    533.6875   25509      12
429 3044 VILAS       WI    0.060  17707    295.1167   16116       9
430 3045 WALWORTH    WI    0.032  75000   2343.7500   72747     454
431 3046 WASHBURN    WI    0.050  13772    275.4400   13585      25
432 3047 WASHINGTON  WI    0.025  95328   3813.1200   94465     125
433 3048 WAUKESHA    WI    0.034 304715   8962.2059  298313    1096
434 3049 WAUPACA     WI    0.045  46104   1024.5333   45695      22
435 3050 WAUSHARA    WI    0.037  19385    523.9189   19094      29
436 3051 WINNEBAGO   WI    0.035 140320   4009.1429  136822     697
437 3052 WOOD        WI    0.048  73605   1533.4375   72157      90
    popamerindian popasian ... percprof  poppovertyknown percpovertyknown
1      98            249   ...  4.355859   63628         96.27478
2      19             48   ...  2.870315   10529         99.08714
3      35             16   ...  4.488572   14235         94.95697
4      46            150   ...  4.197800   30337         98.47757
5      14              5   ...  3.367680    4815         82.50514
6      65            195   ...  3.275891   35107         98.37200
7       8             15   ...  3.209601    5241         98.47802
8      30             61   ...  3.055727   16455         97.91729
9       8             23   ...  3.206799   13081         97.35060
10    331           8033   ... 17.757448  154934         89.54429
11     51             89   ...  3.089998   33788         98.16956
12     26             36   ...  2.776225   15615         98.07801
13     17             29   ...  2.788432   14248         98.53389
14     48            104   ...  2.875296   32190         94.83267
15     92            341   ...  8.144563   45693         88.47688
16  10289         188565   ...  8.329964 5023523         98.40269
17     34             48   ...  3.334084   19123         98.24805
18      6             26   ...  2.690650   10590         99.25023
19    123           1751   ... 11.150967   69127         88.70169
20     37             43   ...  3.308656   16238         98.31678
21     19             41   ...  3.840637   19140         98.33539
22    962          39634   ... 11.963266  771641         98.71748
23     24             24   ...  3.676808   19258         98.28017
24      8             19   ...  2.450687    7350         98.79032
25     45             95   ...  3.783950   31229         98.50177
26     40             35   ...  2.986901   19452         93.10295
27     14             40   ...  3.899083   13860         97.09282
28    106             84   ...  2.432571   39703         98.47218
29     83            105   ...  2.997030   36393         95.56985
30     10             11   ...  2.692308    6737         97.51049
... ...           ...          ...       ...             ...
408  212            36     ... 2.378543   29750          98.42520
409  223            56     ... 4.974496   30890          97.50939
410 1965          1904     ... 4.362722  137496          97.85496
411  127           438     ... 9.365039   71600          98.30979
412   18             9     ... 2.817824    6944          97.70649
413   87           172     ... 5.423401   30557          93.26110
414  321            50     ... 3.393293   34105          98.07897
415  255           786     ... 6.019312   57805          94.13729
416   77            27     ... 2.813520   15271          97.89103
417  521          1004     ... 4.936117  172392          98.49058
418   34            38     ... 3.147935   17254          98.47611
419  369           985     ... 4.370288  135919          97.42599
420   82           114     ... 3.019373   14748          97.80489
421  121           148     ... 5.380106   49388          98.28262
422  288            79     ... 3.970738   46193          98.33528
423 2167            15     ... 4.041667   13897          97.99732
424 1762            70     ... 2.455605   36389          97.93309
425  357          2061     ... 3.836386  101088          97.31509
426   39            44     ... 3.006166   18603          98.42336
427   32            46     ... 2.871216   24533          97.11040
428   36            42     ... 3.624948   25087          97.93106
429 1534            38     ... 4.315256   17446          98.52601
430  201           494     ... 6.082324   71553          95.40400
431  122            33     ... 4.022803   13532          98.25733
432  208           337     ... 4.014568   94143          98.75692
433  672          2699     ... 7.667090  299802          98.38767
434  125            92     ... 3.138596   44412          96.33004
435   70            43     ... 2.620907   19163          98.85478
436  685          1728     ... 5.659847  133950          95.46038
437  481           722     ... 4.583725   72685          98.75008
    percbelowpoverty percchildbelowpovert percadultpoverty percelderlypoverty
1   13.151443        18.011717            11.009776        12.443812
2   32.244278        45.826514            27.385647        25.228976
3   12.068844        14.036061            10.852090        12.697410
4    7.209019        11.179536             5.536013         6.217047
5   13.520249        13.022889            11.143211        19.200000
6   10.399635        14.158819             8.179287        11.008586
7   15.149781        13.787761            12.932331        21.085271
8   11.710726        17.225462            10.027037         9.525052
9   13.875086        17.994784            11.914343        13.660180
10  15.572437        14.132234            17.562728         8.105017
11  11.708299        16.320612             9.569700        11.490641
12  12.007685        15.321547            10.131775        12.595420
13  16.774284        20.582578            14.464114        17.670078
14  10.223672        13.299402             9.253834         8.323176
15  16.748736        16.341941            18.792914        10.993608
16  14.198303        22.293497            11.665542        10.825269
17  10.537050        13.809825             8.870243        10.803387
18  12.049103        13.603185             9.822264        15.284626
19  13.544635         8.678238            17.047419         6.453908
20  10.315310        13.568426             7.955993        12.255345
21   9.629049        13.293543             7.924795         8.714363
22   2.714734         2.945252             2.399064         3.838249
23  16.003739        22.827628            14.480957        11.762014
24  12.204082        15.159868            10.950250        11.859528
25   8.994845        11.599832             6.974466        10.517498
26  13.618137        16.627635            12.134146        13.435829
27   9.264069        13.571228             7.325288         8.787402
28  20.764174        31.074742            19.313537        13.679486
29  15.494738        22.812225            13.996573        11.019603
30  21.433873        29.724656            20.005596        16.230032
... ...              ...                  ...              ...
408 12.094118        14.116632             9.634423        15.588616
409  9.617999        13.966707             8.109616         8.559414
410  6.202362         8.203007             5.022965         6.855924
411  2.180168         1.918955             1.938504         3.547067
412 12.615207        14.882122            10.123967        15.131579
413 10.416598        11.033134            10.337028         9.471418
414 11.822313        16.015585             9.756650        11.164322
415 12.895078        13.558998            13.182182        10.509441
416 10.889922        12.554958             8.145215        14.769573
417 10.151283        15.556437             8.429261         6.811663
418 13.440362        15.792812            12.637111        12.354189
419  9.877206        15.285761             8.143841         6.898250
420 16.578519        20.752427            15.806851        13.128907
421  6.402365         7.892108             4.972513         9.307219
422  9.691945        13.104104             8.148088         9.140333
423 20.544002        29.073570            19.195368        14.179318
424 11.297370        14.932266             9.105113        11.949530
425  6.486428         8.677912             5.146379         7.231785
426 12.664624        15.965037            10.265319        13.889683
427 10.675417        12.919976             7.884145        14.565299
428 15.824929        21.201105            13.449643        14.571429
429 14.736902        23.043367            14.251978         9.173228
430  9.641804         8.699613            10.926610         6.894182
431 15.866095        21.418598            13.642483        14.329455
432  3.237628         4.069854             2.584500         4.280889
433  3.121060         3.785820             2.590061         4.085479
434  8.488697        10.071411             6.953799        10.338641
435 13.786985        20.050708            11.695784        11.804558
436  8.804031        10.592031             8.660587         6.661094
437  8.525831        11.162997             7.375656         7.882918
    inmetro category ratio_child
1   0       AAR      34.48631
2   0       LHR      36.72125
3   0       AAR      35.50130
4   1       ALU      37.44076
5   0       AAR      31.81974
6   0       AAR      34.30845
7   0       LAR      32.67569
8   0       AAR      32.62124
9   0       AAR      34.32314
10  1       HAU      44.53345
11  0       AAR      33.33430
12  0       AAR      32.57961
13  0       LAR      33.28492
14  1       LAU      36.47478
15  0       AAR      43.58299
16  1       AAU      35.51515
17  0       AAR      31.58138
18  0       AAR      36.95408
19  1       HAU      46.34168
20  0       AAR      33.75515
21  0       AAR      35.52199
22  1       HLU      35.73713
23  0       AAR      33.23807
24  0       AAR      32.54032
25  0       AAR      38.56611
26  0       AAR      33.49926
27  0       AAR      32.80560
28  0       LHR      32.50329
29  0       AAR      32.79412
30  0       LHR      32.26227
... ...     ...      ...
408 0       AAR      34.62582
409 0       AAR      30.07039
410 1       HLU      38.30404
411 1       HLU      35.38740
412 0       AAR      35.58463
413 1       HAU      43.16191
414 0       AAR      35.25149
415 0       AAR      42.99487
416 0       AAR      33.24359
417 1       AAU      36.81628
418 0       AAR      35.45460
419 1       AAU      36.87048
420 0       AAR      35.64560
421 1       HLU      38.56242
422 0       AAR      35.39755
423 0       AHR      32.30379
424 0       AAR      34.67987
425 1       ALU      35.56033
426 0       AAR      38.22549
427 0       AAR      34.10125
428 0       AAR      34.09455
429 0       AAR      27.62749
430 0       AAR      37.67733
431 0       AAR      32.49347
432 1       HLU      37.49685
433 1       HLU      35.73109
434 0       AAR      34.69330
435 0       AAR      31.30771
436 1       HAU      36.60205
437 0       AAR      36.42280

In [154]:
head(midwest)

  PID county    state area  poptotal popdensity popwhite popblack popamerindian
1 561 ADAMS     IL    0.052 66090    1270.9615  63917    1702     98
2 562 ALEXANDER IL    0.014 10626     759.0000   7054    3496     19
3 563 BOND      IL    0.022 14991     681.4091  14477     429     35
4 564 BOONE     IL    0.017 30806    1812.1176  29344     127     46
5 565 BROWN     IL    0.018  5836     324.2222   5264     547     14
6 566 BUREAU    IL    0.050 35688     713.7600  35157      50     65
  popasian ... percprof poppovertyknown percpovertyknown percbelowpoverty
1 249      ... 4.355859 63628           96.27478         13.151443
2  48      ... 2.870315 10529           99.08714         32.244278
3  16      ... 4.488572 14235           94.95697         12.068844
4 150      ... 4.197800 30337           98.47757          7.209019
5   5      ... 3.367680  4815           82.50514         13.520249
6 195      ... 3.275891 35107           98.37200         10.399635
  percchildbelowpovert percadultpoverty percelderlypoverty inmetro category
1 18.01172             11.009776        12.443812          0       AAR
2 45.82651             27.385647        25.228976          0       LHR
3 14.03606             10.852090        12.697410          0       AAR
4 11.17954              5.536013         6.217047          1       ALU
5 13.02289             11.143211        19.200000          0       AAR
6 14.15882              8.179287        11.008586          0       AAR
  ratio_child
1 34.48631
2 36.72125
3 35.50130
4 37.44076
5 31.81974
6 34.30845

문제2. 미성년 인구 백분율이 가장 높은 상위 5개 county(지역)의 미성년 인구 백분율을 출력하세요.

In [85]:
midwest %>%
    arrange(desc(ratio_child)) %>% # ratio_child 내림차순 정렬
    select(county, ratio_child) %>% # county, ratio_child 추출
    head(5) # 상위 5 행 출력

  county    ratio_child
1 ISABELLA  51.50117
2 MENOMINEE 50.59126
3 ATHENS    49.32073
4 MECOSTA   49.05918
5 MONROE    47.35818

문제3. 분류표의 기준에 따라 미성년 비율 등급 변수를 추가하고, 각 등급에 몇 개의 지역이 있는지 알아보세요.

In [86]:
# midwest 에 grade 변수 추가
midwest <- midwest %>%
     mutate(grade = ifelse(ratio_child >= 40, "large",
                     ifelse(ratio_child >= 30, "middle", "small")))

# 미성년 비율 등급 빈도표
table(midwest$grade)

 large middle  small
    32    396      9

문제4. popasian은 해당 지역의 아시아인 인구를 나타냅니다. '전체 인구 대비 아시아인 인구 백분율' 변수를
추가하고, 하위 10개 지역의 state(주), county(지역명), 아시아인 인구 백분율을 출력하세요

In [87]:
midwest %>%
 mutate(ratio_asian = (popasian/poptotal)*100) %>% # 백분율 변수 추가
 arrange(ratio_asian) %>% # 내림차순 정렬
 select(state, county, ratio_asian) %>% # 변수 추출
 head(10) # 상위 10 행 출력

   state county    ratio_asian
1  WI    MENOMINEE 0.00000000
2  IN    BENTON    0.01059210
3  IN    CARROLL   0.01594981
4  OH    VINTON    0.02703190
5  WI    IRON      0.03250447
6  IL    SCOTT     0.05315379
7  IN    CLAY      0.06071645
8  MI    OSCODA    0.06375925
9  OH    PERRY     0.06654625
10 IL    PIATT     0.07074865